In [2]:
import numpy as np

import pandas as pd

In [3]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [4]:
dates = pd.date_range("20330101", periods=6)
dates

DatetimeIndex(['2033-01-01', '2033-01-02', '2033-01-03', '2033-01-04',
               '2033-01-05', '2033-01-06'],
              dtype='datetime64[ns]', freq='D')

In [5]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list("ABCD"))
df

                   A         B         C         D
2033-01-01  0.615647  1.050014  0.817656 -0.941518
2033-01-02 -0.129492  0.470755 -1.917390  1.252899
2033-01-03  0.497570  1.189088  1.583562  0.628478
2033-01-04  1.473015  0.489512 -0.623981 -0.793628
2033-01-05  2.441439  0.910378 -0.043894  0.425845
2033-01-06 -0.558974  0.507127  0.936213 -0.153306

In [6]:
# dictinory
dict = {'umair': 20, 'ali': 22, 'ahmed': 19}

In [7]:
df2 = pd.DataFrame(
    {
        "A": 1.0,
        "B": pd.Timestamp("20130102"),
        "C": pd.Series(1, index=list(range(4)), dtype="float32"),
        "D": np.array([3] * 4, dtype="int32"),
        "E": pd.Categorical(["test", "train", "test", "train"]),
        "F": "foo",
    }
)
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [8]:
df2.dtypes

A          float64
B    datetime64[s]
C          float32
D            int32
E         category
F           object
dtype: object

In [9]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, 0 to 3
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       4 non-null      float64
 1   B       4 non-null      datetime64[s]
 2   C       4 non-null      float32
 3   D       4 non-null      int32
 4   E       4 non-null      category
 5   F       4 non-null      object
dtypes: category(1), datetime64[s](1), float32(1), float64(1), int32(1), object(1)
memory usage: 288.0+ bytes

In [10]:
df.head()

                   A         B         C         D
2033-01-01  0.615647  1.050014  0.817656 -0.941518
2033-01-02 -0.129492  0.470755 -1.917390  1.252899
2033-01-03  0.497570  1.189088  1.583562  0.628478
2033-01-04  1.473015  0.489512 -0.623981 -0.793628
2033-01-05  2.441439  0.910378 -0.043894  0.425845

In [11]:
df.tail(3)

                   A         B         C         D
2033-01-04  1.473015  0.489512 -0.623981 -0.793628
2033-01-05  2.441439  0.910378 -0.043894  0.425845
2033-01-06 -0.558974  0.507127  0.936213 -0.153306

In [12]:
df.index

DatetimeIndex(['2033-01-01', '2033-01-02', '2033-01-03', '2033-01-04',
               '2033-01-05', '2033-01-06'],
              dtype='datetime64[ns]', freq='D')

In [13]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [14]:
df.to_numpy()

array([[ 0.61564707,  1.05001424,  0.81765616, -0.94151754],
       [-0.12949161,  0.47075466, -1.91739002,  1.25289924],
       [ 0.49756951,  1.18908849,  1.58356239,  0.62847765],
       [ 1.47301514,  0.48951192, -0.62398103, -0.79362828],
       [ 2.44143916,  0.91037809, -0.04389448,  0.42584521],
       [-0.55897373,  0.50712663,  0.93621326, -0.15330602]])

In [15]:
df2.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

In [16]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.723201  0.769479  0.125361  0.069795
std    1.090697  0.319710  1.266973  0.855180
min   -0.558974  0.470755 -1.917390 -0.941518
25%    0.027274  0.493916 -0.478959 -0.633548
50%    0.556608  0.708752  0.386881  0.136270
75%    1.258673  1.015105  0.906574  0.577820
max    2.441439  1.189088  1.583562  1.252899

In [17]:
df.T

   2033-01-01  2033-01-02  2033-01-03  2033-01-04  2033-01-05  2033-01-06
A    0.615647   -0.129492    0.497570    1.473015    2.441439   -0.558974
B    1.050014    0.470755    1.189088    0.489512    0.910378    0.507127
C    0.817656   -1.917390    1.583562   -0.623981   -0.043894    0.936213
D   -0.941518    1.252899    0.628478   -0.793628    0.425845   -0.153306

In [18]:
# jab axis = 1 to column wise sort hoga, jab axis = 0 to row wise sort hoga
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2033-01-01 -0.941518  0.817656  1.050014  0.615647
2033-01-02  1.252899 -1.917390  0.470755 -0.129492
2033-01-03  0.628478  1.583562  1.189088  0.497570
2033-01-04 -0.793628 -0.623981  0.489512  1.473015
2033-01-05  0.425845 -0.043894  0.910378  2.441439
2033-01-06 -0.153306  0.936213  0.507127 -0.558974

In [19]:
df.sort_values(by="B")

                   A         B         C         D
2033-01-02 -0.129492  0.470755 -1.917390  1.252899
2033-01-04  1.473015  0.489512 -0.623981 -0.793628
2033-01-06 -0.558974  0.507127  0.936213 -0.153306
2033-01-05  2.441439  0.910378 -0.043894  0.425845
2033-01-01  0.615647  1.050014  0.817656 -0.941518
2033-01-03  0.497570  1.189088  1.583562  0.628478

In [20]:
df["A"]

2033-01-01    0.615647
2033-01-02   -0.129492
2033-01-03    0.497570
2033-01-04    1.473015
2033-01-05    2.441439
2033-01-06   -0.558974
Freq: D, Name: A, dtype: float64

In [21]:
df.A

2033-01-01    0.615647
2033-01-02   -0.129492
2033-01-03    0.497570
2033-01-04    1.473015
2033-01-05    2.441439
2033-01-06   -0.558974
Freq: D, Name: A, dtype: float64

In [22]:
df[["B", "A"]]

                   B         A
2033-01-01  1.050014  0.615647
2033-01-02  0.470755 -0.129492
2033-01-03  1.189088  0.497570
2033-01-04  0.489512  1.473015
2033-01-05  0.910378  2.441439
2033-01-06  0.507127 -0.558974

In [23]:
df[0:3]

                   A         B         C         D
2033-01-01  0.615647  1.050014  0.817656 -0.941518
2033-01-02 -0.129492  0.470755 -1.917390  1.252899
2033-01-03  0.497570  1.189088  1.583562  0.628478

In [ ]:
df.shape
# pehle 3 rows aur phir columns

(6, 4)

In [ ]:
df.loc[:,["A","B"]]    # simple loc krne ke liye

                   A         B
2033-01-01  0.615647  1.050014
2033-01-02 -0.129492  0.470755
2033-01-03  0.497570  1.189088
2033-01-04  1.473015  0.489512
2033-01-05  2.441439  0.910378
2033-01-06 -0.558974  0.507127

In [43]:
df.loc["20330102":"20330104", ["A", "B"]]

                   A         B
2033-01-02 -0.129492  0.470755
2033-01-03  0.497570  1.189088
2033-01-04  1.473015  0.489512

In [38]:
# jub index ki base pe select karna ho to iloc use karte hain
df.iloc[2:, 0:3]  # index ko loc krne ke lie

                   A         B         C
2033-01-03  0.497570  1.189088  1.583562
2033-01-04  1.473015  0.489512 -0.623981
2033-01-05  2.441439  0.910378 -0.043894
2033-01-06 -0.558974  0.507127  0.936213

In [40]:
df["20330102":"20330104"]

                   A         B         C         D
2033-01-02 -0.129492  0.470755 -1.917390  1.252899
2033-01-03  0.497570  1.189088  1.583562  0.628478
2033-01-04  1.473015  0.489512 -0.623981 -0.793628

In [41]:
df.loc[dates[0]]

A    0.615647
B    1.050014
C    0.817656
D   -0.941518
Name: 2033-01-01 00:00:00, dtype: float64

In [44]:
df.loc[dates[0], "A"]

np.float64(0.6156470744506478)

In [45]:
df.at[dates[0], "A"]

np.float64(0.6156470744506478)

In [48]:
df

                   A         B         C         D
2033-01-01  0.615647  1.050014  0.817656 -0.941518
2033-01-02 -0.129492  0.470755 -1.917390  1.252899
2033-01-03  0.497570  1.189088  1.583562  0.628478
2033-01-04  1.473015  0.489512 -0.623981 -0.793628
2033-01-05  2.441439  0.910378 -0.043894  0.425845
2033-01-06 -0.558974  0.507127  0.936213 -0.153306

In [ ]:
# iloc is primarily integer position based (from 0 to length-1 of the axis)
df.iloc[3]

A    1.473015
B    0.489512
C   -0.623981
D   -0.793628
Name: 2033-01-04 00:00:00, dtype: float64

In [ ]:
# iloc is used for slicing rows and columns by index positions
df.iloc[3:5, 0:2]

                   A         B
2033-01-04  1.473015  0.489512
2033-01-05  2.441439  0.910378

## we use loc, iloc, and index's to rangle our data (data slicing)

In [51]:
import seaborn as sns
kashti = sns.load_dataset("titanic")

In [57]:
kashti.sample(100)  # random 100 rows select krne ke lie

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
654,0,3,female,18.0,0,0,6.7500,Q,Third,woman,False,NaN,Queenstown,no,True
272,1,2,female,41.0,0,1,19.5000,S,Second,woman,False,NaN,Southampton,yes,False
732,0,2,male,NaN,0,0,0.0000,S,Second,man,True,NaN,Southampton,no,True
631,0,3,male,51.0,0,0,7.0542,S,Third,man,True,NaN,Southampton,no,True
392,0,3,male,28.0,2,0,7.9250,S,Third,man,True,NaN,Southampton,no,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
132,0,3,female,47.0,1,0,14.5000,S,Third,woman,False,NaN,Southampton,no,False
612,1,3,female,NaN,1,0,15.5000,Q,Third,woman,False,NaN,Queenstown,yes,False
129,0,3,male,45.0,0,0,6.9750,S,Third,man,True,NaN,Southampton,no,True
559,1,3,female,36.0,1,0,17.4000,S,Third,woman,False,NaN,Southampton,yes,False
861,0,2,male,21.0,1,0,11.5000,S,Second,man,True,NaN,Southampton,no,False

## sample bhi slicing ki hi aik type but isme random value ke lie

In [58]:
df[df["A"]>0]

                   A         B         C         D
2033-01-01  0.615647  1.050014  0.817656 -0.941518
2033-01-03  0.497570  1.189088  1.583562  0.628478
2033-01-04  1.473015  0.489512 -0.623981 -0.793628
2033-01-05  2.441439  0.910378 -0.043894  0.425845

In [65]:
kashti[kashti["age"]<1]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
78,1,2,male,0.83,0,2,29.0000,S,Second,child,False,NaN,Southampton,yes,False
305,1,1,male,0.92,1,2,151.5500,S,First,child,False,C,Southampton,yes,False
469,1,3,female,0.75,2,1,19.2583,C,Third,child,False,NaN,Cherbourg,yes,False
644,1,3,female,0.75,2,1,19.2583,C,Third,child,False,NaN,Cherbourg,yes,False
755,1,2,male,0.67,1,1,14.5000,S,Second,child,False,NaN,Southampton,yes,False
803,1,3,male,0.42,0,1,8.5167,C,Third,child,False,NaN,Cherbourg,yes,False
831,1,2,male,0.83,1,1,18.7500,S,Second,child,False,NaN,Southampton,yes,False

In [68]:
kashti[kashti["fare"]==0]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
179,0,3,male,36.0,0,0,0.0,S,Third,man,True,NaN,Southampton,no,True
263,0,1,male,40.0,0,0,0.0,S,First,man,True,B,Southampton,no,True
271,1,3,male,25.0,0,0,0.0,S,Third,man,True,NaN,Southampton,yes,True
277,0,2,male,NaN,0,0,0.0,S,Second,man,True,NaN,Southampton,no,True
302,0,3,male,19.0,0,0,0.0,S,Third,man,True,NaN,Southampton,no,True
413,0,2,male,NaN,0,0,0.0,S,Second,man,True,NaN,Southampton,no,True
466,0,2,male,NaN,0,0,0.0,S,Second,man,True,NaN,Southampton,no,True
481,0,2,male,NaN,0,0,0.0,S,Second,man,True,NaN,Southampton,no,True
597,0,3,male,49.0,0,0,0.0,S,Third,man,True,NaN,Southampton,no,True
633,0,1,male,NaN,0,0,0.0,S,First,man,True,NaN,Southampton,no,True
674,0,2,male,NaN,0,0,0.0,S,Second,man,True,NaN,Southampton,no,True
732,0,2,male,NaN,0,0,0.0,S,Second,man,True,NaN,Southampton,no,True
806,0,1,male,39.0,0,0,0.0,S,First,man,True,A,Southampton,no,True
815,0,1,male,NaN,0,0,0.0,S,First,man,True,B,Southampton,no,True
822,0,1,male,38.0,0,0,0.0,S,First,man,True,NaN,Southampton,no,True